DBFILE = 'kimika.db'

GALGROUP = -1001131250808
RHINEGROUP = -1001791817816
KIMIKACACHE = -1001679667908
KIMIKADUSTBIN = -1001741813318
ESUONEGOV = 799852248

WATCHING_LIST_WAIT_SEC = 6

SMART_DEAL_FLAGS = ['\U0001F440']
# flags 👀

TG_REACTIONS = ['\U0001F44D', '\U0001F44E', '\u2764', '\U0001F525',
                '\U0001F970', '\U0001F44F', '\U0001F601', '\U0001F914',
                '\U0001F92F', '\U0001F631', '\U0001F622', '\U0001F389',
                '\U0001F929', '\U0001F92E', '\U0001F4A9', '\U0001F64F',
                '👌', '\U0001F54A', '🤡', '🥱', '\U0001F974', '😍', '🐳', '🐳',  # ❤️‍🔥 unsupported!
                '🌚', '🌭', '💯', '🤣', '⚡', '🍌', '🏆', '💔', '🤨', '😐', '🍓',
                '🍾', '💋', '🖕', '😈']
# 👍, 👎, ❤, 🔥, 🥰, 👏, 😁, 🤔, 🤯, 😱, 🤬, 😢, 🎉, 🤩, 🤮, 💩, 🙏,

NOTHING_REPLY_LIST = [
    '?',
    'なにすん❓',
    'キモいからやめるし',
    'り',
    #    '@Little_lolicon_FBI 有人要認作你爹',
    #    '哈哈，看不懂中文的東西',
    'kimika-sticker/7',  # 價格表
    'kimika-sticker/8',  # ふふっ
    'kimika-sticker/9',  # こんにちは
    'kimika-sticker/10',  # 你今天要寄了嗎
    'kimika-sticker/11',  # capoo 聖誕帽打哈欠
    'kimika-sticker/12',  # 羅翔中指
    'kimika-sticker/13',  # Lisa 1
    'kimika-sticker/14',  # Lisa star eye
    'kimika-sticker/15',  # Lisa 尷尬
    'kimika-sticker/16',  # 呲牙 和善的眼神

]

DISS_REPLY_LIST = [
    '什麼貴物，踢了',
    'kimika-sticker/17',  # 真是欠笑
    'kimika-sticker/19',  # 他🐴的
    'ワロタ',
    'kimika-sticker/20',  # 講道理嘛
    'キモッ',
    'kimika-sticker/18',  # 口區 emoji
]

ART_OF_ASKING = """
**請複製這一條消息，填寫完整後再發上來提問。**
在提問之前請先確認以下幾點：
 1. 我確認 [🔗群表格](https://t.me/RhineLibrary/8235) 裏面找不到我要的東西；
 2. 我確認 [🔗群教程](https://t.me/RhineLibrary/7287) 裏面沒有我想要的答案；
 3. 我確認谷歌搜索搜不出滿意的回答；
 
請在下面填入你的問題（不少於 20 個字）：
我的問題：

請在下面填入如何復現這個問題？
第一步：
第二步：
第三步：
...

請在下面粘貼你遇到的錯誤提示或者信息：
錯誤提示：

請告訴我們你在解決問題的時候做了哪些嘗試？
我嘗試了：

請粘貼屏幕截圖："""

JA_REPLY_LIST = [
    '俺一個星期一本新標日，怎麼會事呢',
    'N1 報名了嗎？考前對策寫了嗎？',
    ['頑張る？', '頑張るます❓'],
    '大丈夫ます！',
    '哈哈，玩玩 Galgame 簡單過個 N1',
    'kimika-sticker/7',  # 價格表
    'kimika-sticker/22',  # ありさドキドキ
    'kimika-sticker/4',  # ......大丈夫？
    'kimika-sticker/21',  # 久美子ドヤ顔
    ['無內鬼，發點日語自學教程', 'https://www.keroq.co.jp/suba_10th/subahibi_fvhd/index.html'],
    '還是本子看太少了，我勸你多看',
    '笔记与试题 贝多芬的象征'
]

KIMIKA_HELP = """
Kimika 問候您，用法：
首先，要引起 Kimika 的注意；
然後打命令：

`diss   `屌人
`giveme `屌伸手黨
`china  `屌小粉紅
`debug  `檢查一條消息
`member `檢查一個群成員
`credit `檢查該人的信譽值
`ja     `學日語

`(無命令) `讓 Kimika 來屌你

特權命令：
`wipe       `消除所有消息然後踢出
`kick       `踢出
`killer add `管理員增加一個 killer
`killer del `管理員消除一個 killer
`killer     `查看特權名單

點歌：告訴我你要找的音樂的網易雲 ID 或者分享連結
傳送 Reaction：
    用 kimika 🔥🤩 或者 kimika 🤮 5 回覆一個人
                       """

CHINA_REPLY_LIST = [
    ['kimika-sticker/24', '平子：我油門呢？'],  # 習近平流汗
    'kimika-sticker/3',  # 笑嘻遼
    'kimika-sticker/26',  # I'm Chinese!
    '不知感恩的東西！',
    'kimika-sticker/27',  # 東雪蓮我❤祖國
    ['kimika-video/25', '无聊，放送点儿歌'],  # 我愛北京天安門
    'kimika-sticker/28',  # 網警看這邊
    'kimika-sticker/29',  # 你完了 我打電話告訴國安
    'kimika-animation/30',  # 中國吃日本
    'kimika-animation/31',  # 習近平雕像掉腦袋
    'kimika-animation/32',  # 64 坦克人
    'kimika-animation/33',  # 習近平直播切換
    '少話，動態清零中',
    'kimika-sticker/23'  # 貓頭公安
]

GIVEME_REPLY_LIST = [
    '再伸手試試看，建議向你爸伸手借女朋友',
    '我知道哪裏有資源！ https://www.google.com.hk',
    ['我知道哪裏有資源！', 'kimika-animation/34'],  # 谷歌氣球
    '伸手黨速爬',
    'kimika-photo/35',  # 好消息 本群和谷歌合作
    'kimika-sticker/36',  # 你稍微動動腦子 - 優質解答
    'kimika-sticker/7'  # 價格表
]

GALGROUP_RULE = """歡迎加群，請閱讀群規：
https://t.me/GalgamerPortal/246"""
